## Plan for org_account/sentinel_oidc
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                  NAME                   |
|----------|-----------------------------------------|
| update   | `aws_iam_role.sentinel_oidc`            |
| recreate | `aws_iam_openid_connect_provider.azure` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_openid_connect_provider.azure must be replaced
-/+ resource "aws_iam_openid_connect_provider" "azure" {
      ~ arn             = "arn:aws:iam::659087519042:oidc-provider/sts.windows.net/221ca1d3-b3f2-4346-8abc-88f802495c7d/" -> (known after apply)
      ~ client_id_list  = [ # forces replacement
            "c8b9cf86-e2b4-4428-b356-14313412a4d1",
          + "50a00e76-8dcf-4c54-b8b1-94f67e340960",
        ]
      ~ id              = "arn:aws:iam::659087519042:oidc-provider/sts.windows.net/221ca1d3-b3f2-4346-8abc-88f802495c7d/" -> (known after apply)
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
      ~ url             = "sts.windows.net/221ca1d3-b3f2-4346-8abc-88f802495c7d/" -> "https://sts.windows.net/221ca1d3-b3f2-4346-8abc-88f802495c7d/"
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.sentinel_oidc will be updated in-place
  ~ resource "aws_iam_role" "sentinel_oidc" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "sts.windows.net/221ca1d3-b3f2-4346-8abc-88f802495c7d/:aud" = "c8b9cf86-e2b4-4428-b356-14313412a4d1"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::659087519042:oidc-provider/sts.windows.net/221ca1d3-b3f2-4346-8abc-88f802495c7d/"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "Sentinel-OIDC-Organizations-ReadOnly"
        name                  = "Sentinel-OIDC-Organizations-ReadOnly"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_openid_connect_provider.azure"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sentinel_oidc"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
